# Data Cleaning and Preparation

In [7]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Handling Missing Data
.isnull()
.notnull()
.isna()
.notna()
.dropna(axis=0, inplace=False, **kwargs how='all',thresh=n)
.fillna(value=Scalar value or dict-like object , method='ffill', axis=None, inplace=False, limit=n, downcast=None, **kwargs) 
fillna with a dict, you can use a different fill value for each column:

In [56]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [57]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [58]:
string_data.isna()

0     True
1    False
2     True
3    False
dtype: bool

In [59]:
string_data.notna()

0    False
1     True
2    False
3     True
dtype: bool

In [60]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

### Filtering Out Missing Data

In [61]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [63]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [62]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [69]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data
cleaned

     0    1    2
0  1.0  6.5  3.0

In [70]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [71]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [72]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [73]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [74]:
data[4] = NA
data
data.dropna(axis=0, how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [75]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.152677 -1.565657 -0.562540
1 -0.032664 -0.929006 -0.482573
2 -0.036264  1.095390  0.980928
3 -0.589488  1.581700 -0.528735
4  0.457002  0.929969 -1.569271
5 -1.022487 -0.402827  0.220487
6 -0.193401  0.669158 -1.648985

In [76]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.152677       NaN       NaN
1 -0.032664       NaN       NaN
2 -0.036264       NaN  0.980928
3 -0.589488       NaN -0.528735
4  0.457002  0.929969 -1.569271
5 -1.022487 -0.402827  0.220487
6 -0.193401  0.669158 -1.648985

In [77]:
df.dropna()

          0         1         2
4  0.457002  0.929969 -1.569271
5 -1.022487 -0.402827  0.220487
6 -0.193401  0.669158 -1.648985

In [78]:
df.dropna(thresh=2)

          0         1         2
2 -0.036264       NaN  0.980928
3 -0.589488       NaN -0.528735
4  0.457002  0.929969 -1.569271
5 -1.022487 -0.402827  0.220487
6 -0.193401  0.669158 -1.648985

### Filling In Missing Data

In [79]:
df

          0         1         2
0  0.152677       NaN       NaN
1 -0.032664       NaN       NaN
2 -0.036264       NaN  0.980928
3 -0.589488       NaN -0.528735
4  0.457002  0.929969 -1.569271
5 -1.022487 -0.402827  0.220487
6 -0.193401  0.669158 -1.648985

In [80]:
df.fillna(0)

          0         1         2
0  0.152677  0.000000  0.000000
1 -0.032664  0.000000  0.000000
2 -0.036264  0.000000  0.980928
3 -0.589488  0.000000 -0.528735
4  0.457002  0.929969 -1.569271
5 -1.022487 -0.402827  0.220487
6 -0.193401  0.669158 -1.648985

In [81]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.152677  0.500000  0.000000
1 -0.032664  0.500000  0.000000
2 -0.036264  0.500000  0.980928
3 -0.589488  0.500000 -0.528735
4  0.457002  0.929969 -1.569271
5 -1.022487 -0.402827  0.220487
6 -0.193401  0.669158 -1.648985

In [82]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.152677  0.000000  0.000000
1 -0.032664  0.000000  0.000000
2 -0.036264  0.000000  0.980928
3 -0.589488  0.000000 -0.528735
4  0.457002  0.929969 -1.569271
5 -1.022487 -0.402827  0.220487
6 -0.193401  0.669158 -1.648985

In [84]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -2.252797 -1.166832  0.353607
1  0.702110 -0.274569 -0.139142
2  0.107657 -0.606545 -0.417064
3 -0.017007 -1.224145 -1.800840
4  1.634736  0.989008  0.457940
5  0.555154  1.306720 -0.440554

In [85]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -2.252797 -1.166832  0.353607
1  0.702110 -0.274569 -0.139142
2  0.107657       NaN -0.417064
3 -0.017007       NaN -1.800840
4  1.634736       NaN       NaN
5  0.555154       NaN       NaN

In [86]:
df.fillna(method='ffill')

          0         1         2
0 -2.252797 -1.166832  0.353607
1  0.702110 -0.274569 -0.139142
2  0.107657 -0.274569 -0.417064
3 -0.017007 -0.274569 -1.800840
4  1.634736 -0.274569 -1.800840
5  0.555154 -0.274569 -1.800840

In [87]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -2.252797 -1.166832  0.353607
1  0.702110 -0.274569 -0.139142
2  0.107657 -0.274569 -0.417064
3 -0.017007 -0.274569 -1.800840
4  1.634736       NaN -1.800840
5  0.555154       NaN -1.800840

In [88]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [89]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation
.duplicate(keep='first')
drop_duplicates(keep='first', inplace=False)  keep : {'first', 'last', ``False``}, default 'first'

### Removing Duplicates

In [91]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [92]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [93]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [94]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [45]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [46]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [95]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [97]:
data.dtypes

food       object
ounces    float64
dtype: object

In [96]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [49]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [50]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [51]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values
map can be used to modify a subset of values in
an object but replace provides a simpler and more flexible way to do so.

In [52]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [55]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
data.replace({-999: np.nan, -1000: 0})

### Renaming Axis Indexes

In [110]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [111]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [112]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [113]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [114]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [115]:
data
# rename will not modify the original

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [117]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data
 #rename can be used in conjunction with a dict-like object providing new values for a subset of the axis labels

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [118]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [119]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [120]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [121]:
cats.categories
#a parenthesis means that the side is open, while the square bracket means it is closed (inclusive).

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [122]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [123]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)
# You can change the side is open or close by select which side is closed by passing right=False:

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [124]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [125]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)
# it will compute equal-length bins based on the minimum and maximum values in the data
#The precision=2 option limits the decimal precision to two digits.

[(0.75, 1.0], (0.25, 0.5], (0.75, 1.0], (0.75, 1.0], (0.5, 0.75], ..., (0.75, 1.0], (-0.00089, 0.25], (0.5, 0.75], (0.25, 0.5], (-0.00089, 0.25]]
Length: 20
Categories (4, interval[float64]): [(-0.00089, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

In [126]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats
# using cut will not usually result in each bin having the same number of data points. Since qcut uses sample quantiles instead, by definition
#you will obtain roughly equal-size bins:

[(0.606, 3.928], (0.606, 3.928], (-2.9499999999999997, -0.68], (0.606, 3.928], (-0.68, -0.0348], ..., (-0.68, -0.0348], (-0.68, -0.0348], (-0.0348, 0.606], (-2.9499999999999997, -0.68], (-2.9499999999999997, -0.68]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -0.68] < (-0.68, -0.0348] < (-0.0348, 0.606] < (0.606, 3.928]]

In [127]:
pd.value_counts(cats)

(0.606, 3.928]                  250
(-0.0348, 0.606]                250
(-0.68, -0.0348]                250
(-2.9499999999999997, -0.68]    250
dtype: int64

In [128]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

#pass your own quantiles (numbers between 0 and 1, inclusive):

[(-0.0348, 1.289], (-0.0348, 1.289], (-1.172, -0.0348], (-0.0348, 1.289], (-1.172, -0.0348], ..., (-1.172, -0.0348], (-1.172, -0.0348], (-0.0348, 1.289], (-2.9499999999999997, -1.172], (-1.172, -0.0348]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -1.172] < (-1.172, -0.0348] < (-0.0348, 1.289] < (1.289, 3.928]]

In [130]:
pd.value_counts(pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]))

(-0.0348, 1.289]                 400
(-1.172, -0.0348]                400
(1.289, 3.928]                   100
(-2.9499999999999997, -1.172]    100
dtype: int64

### Detecting and Filtering Outliers

In [131]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046689     0.049920     0.027980    -0.007221
std       0.996391     1.005860     1.005301     0.997367
min      -3.428254    -3.645860    -3.184377    -3.745356
25%      -0.740152    -0.603384    -0.610007    -0.699383
50%      -0.084206     0.052073    -0.008168    -0.022158
75%       0.624413     0.770280     0.688640     0.699046
max       3.366626     2.653656     3.525865     2.735527

In [132]:
col = data[2]
col[np.abs(col) > 3]

37     3.260383
212   -3.056990
299   -3.184377
759    3.525865
Name: 2, dtype: float64

In [133]:
data[(np.abs(data) > 3).any(1)]
# you can use the any method on a boolean DataFrame

            0         1         2         3
18  -2.315555  0.457246 -0.025907 -3.399312
37   0.050188  1.951312  3.260383  0.963301
113  0.146326  0.508391 -0.196713 -3.745356
212 -0.293333 -0.242459 -3.056990  1.918403
236 -3.428254 -0.296336 -0.439938 -0.867165
299  0.275144  1.179227 -3.184377  1.369891
521 -0.362528 -3.548824  1.553205 -2.186301
613  3.366626 -2.372214  0.851010  1.332846
759 -0.658090 -0.207434  3.525865  0.283070
780  0.599947 -3.645860  0.255475 -0.549574

In [134]:
data[np.abs(data) > 3] = np.sign(data) * 3
# cap values outside the interval 3 to 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046627     0.051115     0.027435    -0.006076
std       0.993835     1.001868     1.002051     0.993563
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.740152    -0.603384    -0.610007    -0.699383
50%      -0.084206     0.052073    -0.008168    -0.022158
75%       0.624413     0.770280     0.688640     0.699046
max       3.000000     2.653656     3.000000     2.735527

In [135]:
np.sign(data).head()
#The statement np.sign(data) produces 1 and 1 values based on whether the values in data are positive or negative:

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1  1.0 -1.0 -1.0 -1.0
2 -1.0  1.0 -1.0  1.0
3  1.0 -1.0  1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

### Permutation and Random Sampling

In [136]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([1, 0, 4, 2, 3])

In [137]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [138]:
df.take(sampler)
# That array can then be used in iloc-based indexing or the equivalent take function:

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15

In [139]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [140]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws
#To generate a sample with replacement (to allow repeat choices)

3    6
1    7
0    5
0    5
2   -1
4    4
0    5
1    7
2   -1
3    6
dtype: int64

### Computing Indicator/Dummy Variables

In [141]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])
#If a column in a DataFrame has k distinct values, you would derive a matrix or Data Frame with k columns containing all 1s and 0s.

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [142]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [143]:
#If a row in a DataFrame belongs to multiple categories
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

C:\Users\changchuanpan\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  after removing the cwd from sys.path.

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [151]:
#step 1 extract the list of unique genres in the dataset
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [152]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [153]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies.head()
#start with a DataFrame of all zeros

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [154]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [155]:
gen

"Animation|Children's|Comedy"

In [156]:
# iterate through each movie and set entries in each row of dummies to 1.Then, we can use .iloc to set values based on these indices:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [157]:
# as before, you can combine this with movies
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
                                ...
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, Length: 21, dtype: object

In [158]:
#A useful recipe for statistical applications is to combine get_dummies with a discretization function like cut
np.random.seed(12345)
values = np.random.rand(10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String Manipulation

### String Object Methods

In [159]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [160]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [161]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [162]:
'::'.join(pieces)

'a::b::guido'

In [163]:
'guido' in val
val.index(',')
val.find(':')

-1

In [164]:
val.index(':')
# the difference between find and index is that index raises an exception if the string isnt found (versus returning 1)

ValueError: substring not found

In [165]:
val.count(',')

2

In [168]:
val.replace(',', '::')

'a::b::  guido'

In [167]:
val.replace(',', '')

'a,b,  guido'

### Regular Expressions

In [169]:
#Regular expressions provide a flexible way to search or match (often more complex) string patterns in text.
# The re module functions fall into three categories: pattern matching, substitution,and splitting.
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [170]:
# the regular expression is first compiled, and then its split method is called on the passed text. 
regex = re.compile('\s+')
regex

re.compile(r'\s+', re.UNICODE)

In [171]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [172]:
regex.findall(text)

['    ', '\t ', '  \t']

In [173]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [174]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [180]:
m = regex.search(text)
m

In [175]:
text[m.start():m.end()]
#findall returns all matches in a string, search returns only the first match. More rigidly, match only matches at the beginning of the string.

'dave@google.com'

In [176]:
print(regex.match(text))

None

In [177]:
print(regex.sub('REDACTED', text))
#sub will return a new string with occurrences of the pattern replaced by the a new string

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [178]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [181]:
m = regex.match('wesm@bright.net')
m.groups()
#Return a tuple containing all the subgroups of the match,

('wesm', 'bright', 'net')

In [182]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [183]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))
#sub also has access to groups in each match using special symbols like \1 and \2.

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [184]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [185]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [186]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [187]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches
#a couple of ways to do vectorized element retrieval. Either use str.get or index into the str attribute:

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [192]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [189]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [190]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [193]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

## Conclusion